In [2]:
import pandas as pd
from pandas import DataFrame
filename='C:/Users/Admin/OneDrive/Desktop/nyc_taxi_2019-01.csv'
df=pd.read_csv(filename, usecols=['passenger_count','trip_distance','total_amount'])
df.head()

   passenger_count  trip_distance  total_amount
0                1            1.5          9.95
1                1            2.6         16.30
2                3            0.0          5.80
3                5            0.0          7.55
4                5            0.0         55.55

In [3]:
df.sort_values('trip_distance',ascending=False)['total_amount'].iloc[:20].mean()

290.00999999999993

In [4]:
df.sort_values('trip_distance',kind='mergsort')['total_amount'].iloc[-20:].mean()

290.01000000000005

In [5]:
df.sort_values('trip_distance',kind='heapsort')['total_amount'].iloc[-20:].mean()

290.01000000000005

In [11]:
df.sort_values(['passenger_count','trip_distance'], ascending=[True,False]).iloc[50:]

         passenger_count  trip_distance  total_amount
157070                 0           29.1         70.00
1647945                0           29.1         70.26
1688231                0           29.0        133.80
5148599                0           29.0        115.86
341819                 0           28.9         75.66
...                  ...            ...           ...
2883943                9            0.0         12.25
4534691                9            0.0        110.76
4852210                9            0.0         12.74
4997772                9            0.0          9.80
7286548                9            0.0         10.30

[7667742 rows x 3 columns]

In [22]:
df.sort_values(['passenger_count','trip_distance'], ascending=[True,False])['total_amount'].iloc[50:].mean()

15.681440866163728

In [12]:
 df.groupby(['passenger_count'])['total_amount'].mean().sort_values()

passenger_count
6    15.437892
5    15.546940
3    15.604015
1    15.609601
4    15.650307
2    15.831294
0    18.663658
9    31.094444
7    48.278421
8    64.105517
Name: total_amount, dtype: float64

In [6]:
 df.groupby(['passenger_count'])['total_amount'].mean().sort_index()

passenger_count
0    18.663658
1    15.609601
2    15.831294
3    15.604015
4    15.650307
5    15.546940
6    15.437892
7    48.278421
8    64.105517
9    31.094444
Name: total_amount, dtype: float64

In [13]:
bins=[df['trip_distance'].min(), 2, 10,df['trip_distance'].max()]
labels=['Short','Medium','Long']
df['trip_distance_group']=pd.cut(df['trip_distance'],bins,labels)
df

         passenger_count  trip_distance  total_amount trip_distance_group
0                      1           1.50          9.95          (0.0, 2.0]
1                      1           2.60         16.30         (2.0, 10.0]
2                      3           0.00          5.80                 NaN
3                      5           0.00          7.55                 NaN
4                      5           0.00         55.55                 NaN
...                  ...            ...           ...                 ...
7667787                1           4.79         23.16         (2.0, 10.0]
7667788                1           0.00          0.00                 NaN
7667789                1           0.00          0.00                 NaN
7667790                1           0.00          0.00                 NaN
7667791                1           0.00          0.00                 NaN

[7667792 rows x 4 columns]

In [15]:
df.groupby('trip_distance_group')['passenger_count'].mean().sort_values()

trip_distance_group
(0.0, 2.0]       1.558400
(2.0, 10.0]      1.585319
(10.0, 831.8]    1.590035
Name: passenger_count, dtype: float64

In [16]:
df.groupby('trip_distance_group')['passenger_count'].mean().sort_values(ascending=False)

trip_distance_group
(10.0, 831.8]    1.590035
(2.0, 10.0]      1.585319
(0.0, 2.0]       1.558400
Name: passenger_count, dtype: float64

In [17]:
df['cost_km'] = df['total_amount'] / df['trip_distance']
top_5_expensive_trips = df.nlargest(5, 'cost_km')

top_5_expensive_trips[['trip_distance', 'total_amount']]

   trip_distance  total_amount
2            0.0          5.80
3            0.0          7.55
4            0.0         55.55
5            0.0         13.31
6            0.0         55.55

In [18]:
df['amount_par_person'] = df['total_amount'] / df['passenger_count']
df_sorted = df.sort_values('amount_par_person', ascending=False)
top_10_expensive_trips = df_sorted.head(10)
top_10_expensive_trips[['trip_distance', 'amount_per_person']]

         trip_distance  amount_per_person
6757567            0.9                inf
3582605            6.1                inf
3582481            1.2                inf
2007665           10.6                inf
2007664            2.5                inf
289983             0.8                inf
289984             0.8                inf
289985             1.2                inf
289991             0.8                inf
2007628            8.8                inf

In [20]:
df_sorted = df.sort_values('trip_distance', ascending=False, ignore_index=True)
top_20_long_trips = df_sorted.loc[:19]
average_total_amount = top_20_long_trips['total_amount'].mean()
average_total_amount

290.00999999999993

In [21]:
#Exercice 2

In [5]:
#question-1
import pandas as pd
filename = "C:/Users/Admin/OneDrive/Desktop/DP_LIVE_15062023160604036.csv"
df = pd.read_csv(filename,usecols=['LOCATION','SUBJECT','TIME','Value'])
df

     LOCATION SUBJECT  TIME     Value
0         HUN     TOT  1995  264.1895
1         HUN     TOT  1996  289.8627
2         HUN     TOT  1997  306.5918
3         HUN     TOT  1998  305.4271
4         HUN     TOT  1999  325.9615
...       ...     ...   ...       ...
1718      ESP     TOT  2016  399.3086
1719      ESP     TOT  2017  392.2701
1720      ESP     TOT  2018  385.2155
1721      ESP     TOT  2019  390.2174
1722      ESP     TOT  2020  420.3188

[1723 rows x 4 columns]

In [7]:
df_sum = df.groupby('LOCATION')['Value'].sum().reset_index()
df_mean = df_sum.groupby('LOCATION')['Value'].mean().reset_index()
df5 = df_mean.nlargest(5, 'Value')
print(df5)

   LOCATION         Value
38      USA  4.107715e+06
5       CHE  3.154986e+06
2       BEL  2.595613e+06
22      JPN  2.319271e+06
4       CAN  2.175684e+06

In [8]:
df_bottom5 = df_mean.nsmallest(5, 'Value')
print(df_bottom5)

   LOCATION        Value
7       COL   76613.9240
37      TUR   82754.6220
3       BRA  111296.5030
33      RUS  130623.1630
27      MEX  261043.8617

In [15]:
filename = "C:/Users/Admin/OneDrive/Desktop/oecd_locations.csv"
df6 = pd.read_csv(filename,index_col='AUS')
df6

          Australia
AUS
AUT         Austria
BEL         Belgium
CAN          Canada
DNK         Denmark
FIN         Finland
FRA          France
DEU         Germany
HUN         Hungary
ITA           Italy
JPN           Japan
KOR           Korea
GBR  United Kingdom
USA   United States
BRA          Brazil
ISR          Israel

In [23]:
df_merged = pd.merge(df, df6, left_on='LOCATION', right_index=True)
df_merged['NAM'] = df_merged['LOCATION']
df_merged = df_merged.drop(columns='LOCATION')
df_merged

     SUBJECT  TIME       Value Australia  NAM
0        TOT  1995    264.1895   Hungary  HUN
1        TOT  1996    289.8627   Hungary  HUN
2        TOT  1997    306.5918   Hungary  HUN
3        TOT  1998    305.4271   Hungary  HUN
4        TOT  1999    325.9615   Hungary  HUN
...      ...   ...         ...       ...  ...
1582   FINAN  2016   8964.2590    Brazil  BRA
1583   FINAN  2017  12102.5400    Brazil  BRA
1584   FINAN  2018  12644.2300    Brazil  BRA
1585   FINAN  2019  13855.2300    Brazil  BRA
1586   FINAN  2020  15991.8800    Brazil  BRA

[716 rows x 5 columns]